### 종합실습1

In [1]:
import pandas as pd

# 예시 상품 판매 데이터
sales_data = {
    'OrderID': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    'Product': ['Laptop', 'Mouse', 'Laptop', 'Monitor', 'Mouse', 'Keyboard', 'Laptop', 'Mouse', 'Monitor', 'Keyboard'],
    'Quantity': [1, 2, 1, 1, 2, 1, 1, 3, 1, 1],
    'Price': [1200, 25, 1200, 300, 25, 100, 1200, 25, 300, 100],
    'CustomerID': [1001, 1002, 1001, 1003, 1004, 1002, 1001, 1003, 1005, 1002],
    'OrderDate': ['2024-01-05', '2024-01-06', '2024-01-07', '2024-01-10', '2024-01-12', '2024-01-15', '2024-01-18', '2024-01-20', '2024-01-22', '2024-01-25']
}
df_sales = pd.DataFrame(sales_data)
df_sales

   OrderID   Product  Quantity  Price  CustomerID   OrderDate
0      101    Laptop         1   1200        1001  2024-01-05
1      102     Mouse         2     25        1002  2024-01-06
2      103    Laptop         1   1200        1001  2024-01-07
3      104   Monitor         1    300        1003  2024-01-10
4      105     Mouse         2     25        1004  2024-01-12
5      106  Keyboard         1    100        1002  2024-01-15
6      107    Laptop         1   1200        1001  2024-01-18
7      108     Mouse         3     25        1003  2024-01-20
8      109   Monitor         1    300        1005  2024-01-22
9      110  Keyboard         1    100        1002  2024-01-25

In [2]:
df_sales.groupby('CustomerID')['Price'].sum()

CustomerID
1001    3600
1002     225
1003     325
1004      25
1005     300
Name: Price, dtype: int64

In [3]:
# df_sales['Total'] = df_sales['Quantity'] * df_sales['Price']
df_sales[df_sales['Product'] == 'Laptop'][['Price']].mean()

Price    1200.0
dtype: float64

In [4]:
df_sales.groupby('Product')[['Quantity']].sum().sort_values('Quantity',ascending=False)

          Quantity
Product
Mouse            7
Laptop           3
Keyboard         2
Monitor          2

In [5]:
df_sales['OrderDate']=pd.to_datetime(df_sales['OrderDate'])
df_sales[df_sales['OrderDate'] >= '2024-01-10']

   OrderID   Product  Quantity  Price  CustomerID  OrderDate
3      104   Monitor         1    300        1003 2024-01-10
4      105     Mouse         2     25        1004 2024-01-12
5      106  Keyboard         1    100        1002 2024-01-15
6      107    Laptop         1   1200        1001 2024-01-18
7      108     Mouse         3     25        1003 2024-01-20
8      109   Monitor         1    300        1005 2024-01-22
9      110  Keyboard         1    100        1002 2024-01-25

In [6]:
df_sales['Total'] = df_sales['Quantity'] * df_sales['Price']

product_stats = df_sales.groupby('Product').agg({
    'Quantity': 'sum',
    'Total': 'sum'
})

result = product_stats.sort_values(by='Total', ascending=False)
result

          Quantity  Total
Product
Laptop           3   3600
Monitor          2    600
Keyboard         2    200
Mouse            7    175

### 종합실습2

In [7]:
preference_data = {
    'UserID': [1, 2, 3, 1, 5, 6, 3, 2, 3, 5],
    'ContentID': [101, 102, 101, 103, 104, 105, 106, 101, 107, 102],
    'ContentType': ['Movie', 'Music', 'Movie', 'Book', 'Movie', 'Music', 'Book', 'Movie', 'Music', 'Book'],
    'Rating': [5, 3, 4, 2, 5, 4, 3, 4, 5, 2],
    'ReviewDate': ['2024-02-01', '2024-02-02', '2024-02-03', '2024-02-05', '2024-02-07', '2024-02-10', '2024-02-12', '2024-02-14', '2024-02-15', '2024-02-20']
}
df_preference = pd.DataFrame(preference_data)
df_preference

   UserID  ContentID ContentType  Rating  ReviewDate
0       1        101       Movie       5  2024-02-01
1       2        102       Music       3  2024-02-02
2       3        101       Movie       4  2024-02-03
3       1        103        Book       2  2024-02-05
4       5        104       Movie       5  2024-02-07
5       6        105       Music       4  2024-02-10
6       3        106        Book       3  2024-02-12
7       2        101       Movie       4  2024-02-14
8       3        107       Music       5  2024-02-15
9       5        102        Book       2  2024-02-20

In [8]:
df_preference.groupby('ContentType')[['Rating']].mean()

               Rating
ContentType
Book         2.333333
Movie        4.500000
Music        4.000000

In [9]:
df_preference.groupby('ContentID')[['Rating']].max().head(1)

           Rating
ContentID
101             5

In [10]:
df_preference['ReviewDate'] = pd.to_datetime(df_preference['ReviewDate'])

df_preference[(df_preference['ReviewDate'] >= '2024-02-10') & (df_preference['Rating'] >= 4)]

   UserID  ContentID ContentType  Rating ReviewDate
5       6        105       Music       4 2024-02-10
7       2        101       Movie       4 2024-02-14
8       3        107       Music       5 2024-02-15

In [11]:
df_preference.groupby('UserID')[['ContentID']].count()

        ContentID
UserID
1               2
2               2
3               3
5               2
6               1